{
  "pages": [
    {
      "text": "Most of you playing Ultimate would've already heard this from one of\nthe senior players on your team, but here we go, anyway: There are\nonly two speeds for cutters in Ultimate, zero and full-speed.  This\nmay be a little bit of an exception, but most players who have played\nfor a few months would already realize that handlers don't give you a\ndisk, if you are not cutting at your full speed!  But, the speed rule\ndoesn't hold true only when you are cutting.  It holds when you are\nclearing too!  You need to be clearing as hard as you cut, and still\n\"remain active\" when you are clearing.  By active, I mean that you\nshould still be expecting a pass from the handler, and be ready to\ncatch anything that your handlers sends at you.  Even if that's not\nthe case, you should atleast make your defender believe that you are\nactive.  Otherwise, he/she can poach on you!\nI often use the \"extent\" to which my defender is poaching on me, as an\nindicator of how active I am on the field.  If I'm letting my defender\npoach on me and get discs going to other players on my team, I'm\ndefinitely not being active enough.  This can be used as an indicator\nnot just when I'm standing in the (vert/ho) stack and waiting, but\nalso when I'm clearing.  When clearing, you should ideally be looking\nat your handler atleast from the corner of your eye, and keep looking\nfor opportunities of asking for a pass, the moment your defender\nslackens a little upon you.", 
      "tags": "", 
      "loc": "/posts/clearing-out-properly.html", 
      "title": "Clearing out, properly"
    }, 
    {
      "text": "I'm going to post one rule a week, starting this week, and this should\nensure at least one post a week up to Feb, '14!\nI'm also going to post the official interpretations of the rules, from\nthe WFDF interpretation guide that complements the rule book.\nThe WFDF interpretation guide also mentions the general principles on\nwhich the rules of Ultimate are based.  It would definitely help\nplayers to be aware of these principles.\n\nGeneral Principles for the Rules of Ultimate (from WFDF interpretations)\nThe Rules of Ultimate are based on principles that outline how the\ngame should be played and how to resolve issues. When encountering a\nscenario that is not expressly described by the rules, these\nprinciples are a good guide to help resolve the issue:\n\nIt is trusted that no player will intentionally violate the rules;\nthus there are no harsh penalties for breaches, but rather a method\nfor resuming play in a manner which simulates what would most likely\nhave occurred had there been no breach.\nA team should not be disadvantaged because the opposition has made\nan error or caused a breach.\nCalls should only be made where a breach has occurred that has a\nmeaningful impact on the game. Players should allow for a reasonable\ndegree of tolerance for minor breaches involving small discrepancies\nin distance and time.\nNot everybody sees a situation in the same light. Two players with a\nvery good view of a situation can still see very different things\nhappening. Human perception is not perfect. Players should be aware\nof this when trying to resolve calls.\nIf a call cannot be resolved then the disc shall be returned to\nwhere possession was last undisputed and play shall resume as it was\nprior to the call.\n\n\n\nRule #1: Spirit of the Game\n\nUltimate is a non-contact, self-refereed sport. All players are\nresponsible for administering and adhering to the rules. Ultimate\nrelies upon a Spirit of the Game that places the responsibility for\nfair play on every player.\nIt is trusted that no player will intentionally break the rules;\nthus there are no harsh penalties for breaches, but rather a method\nfor resuming play in a manner which simulates what would most\nlikely have occurred had there been no breach.\nPlayers should be mindful of the fact that they are acting as\nreferees in any arbitration between teams. Players must:\nknow the rules;\nbe fair-minded and objective;\nbe truthful;\nexplain their viewpoint clearly and briefly;\nallow opponents a reasonable chance to speak;\nresolve disputes as quickly as possible, using respectful\nlanguage;\nmake calls in a consistent manner throughout the game;\nonly make a call where a breach is significant enough to make a\ndifference to the outcome of the action.\n\n\nHighly competitive play is encouraged, but should never sacrifice\nthe mutual respect between players, adherence to the agreed-upon\nrules of the game, or the basic joy of play.\nThe following actions are examples of good spirit:\ninforming a team-mate if they have made a wrong or unnecessary\ncall or caused a foul or violation;\nretracting a call when you no longer believe the call was\nnecessary;\ncomplimenting an opponent for good play or spirit;\nintroducing yourself to your opponent; and\nreacting calmly towards disagreement or provocation.\n\n\nThe following actions are clear violations of the spirit of the\ngame and must be avoided by all participants:\ndangerous play and aggressive behaviour;\nintentional fouling or other intentional rule violations;\ntaunting or intimidating opposing players;\ndisrespectful celebration after scoring;\nmaking calls in retaliation to an opponent’s call; and\ncalling for a pass from an opposition player.\n\n\nTeams are guardians of the Spirit of the Game, and must:\ntake responsibility for teaching their players the rules and\ngood spirit;\ndiscipline players who display poor spirit; and\nprovide constructive feedback to other teams about how to\nimprove their adherence to the Spirit of the Game.\n\n\nIn the case where a novice player commits an infraction out of\nignorance of the rules, experienced players are obliged to explain\nthe infraction.\nAn experienced player, who offers advice on rules and guides\non-field arbitration, may supervise games involving beginners or\nyounger players.\nRules should be interpreted by the players directly involved in the\nplay, or by players who had the best perspective on the\nplay. Non-players, apart from the captain, should refrain from\ngetting involved. However players may seek the perspective of\nnon-players to clarify the rules, and to assist players to make the\nappropriate call for \"down\" calls and line calls.\nPlayers and captains are solely responsible for making all calls.\nIf, after discussion, players cannot agree what occurred in a play,\nthe disc shall be returned to the last non-disputed thrower.\n\n\n\nInterpretations\n\nProviding evidence to support a call (1.3.4)\n\nWhat\nIt is an essential component of good spirit that a player must\nbe prepared, if asked, to explain concisely the objective\nevidence that led to making a call, or contesting a call.\n\nExample\nAfter making a travel call, if asked, the defender might explain\n\"I saw you lift your pivot foot while the disc was still in your\nhand.\"\n\nWhy\nThe objective evidence is evidence that can be tested for\nvalidity. It makes it clear that the call was not based on\nemotion or what the player wanted or expected to happen, but what\nthey actually observed.\nIf a player is not reasonably certain of the objective evidence,\nthey should not make a call.\n\nExtra\nPlayers should be aware and understanding of the language\nlimitations accompanying international play, however opponents\nshould still be able to communicate, even through gestures, what\nthey saw. Team captains and team mates should get involved if\nthey think their team’s player is wrong or does not behave\ncorrectly.\n\n\n\nMaking calls in a consistent manner throughout the game (1.3.7)\n\nWhat\nPlayers should make calls without taking into account the\ncontext of the game. This means that players should not start\nmaking more calls just because the game is nearly over and the\nscores are quite close.\n\nExample\nIf at the start of the game minor travel infractions were not\ncalled, then they should not be called later in the game.\n\n\n\nOnly calling significant breaches (1.3.8)\n\nWhat\nPlayers should allow for a reasonable degree of tolerance for\nminor breaches involving small discrepancies in distance and\ntime.\n\nExample\nIf the thrower established a pivot one centimetre away from the\ncorrect pivot point then a travel infraction should not be called.\n\n\n\nDisrespectful celebration after scoring (1.6.4)\n\nWhat\nThis includes spiking directed at an opponent and taunting of the\nopponent by \"showing\" them the disc. These actions must be\navoided.\n\nResult\nOpposing team captains should discuss all matters relating to\nviolations of spirit and try to resolve them.\n\n\n\nSeeking perspective from non players (1.10)\n\nNote\nIt is still up to the players involved to make the final\ncall. Non players must not provide verbal advice regarding a call\nunless they are requested to by the players involved.\nLine calls are defined as any call relating to the spot that the\ndisc became or went out-of-bounds, or a player's position\nrelative to the perimeter lines or goal line. Line calls relate\nto the following calls: \"out-of-bounds\", \"goal\" and \"offside\".\n\n\n\nDiscussion of what occurred in a play (1.12)\n\nNote\nBefore the disc is returned to the thrower when players cannot\nagree, players should discuss what happened in the play. Both\nplayers involved should attempt to clearly explain what they\nthink happened and listen to the view of their opponent, or other\nplayers with good perspective on the play.\nIf discussion is difficult due to a language barrier, then\ngestures or recreations of the incident can be used to indicate\nwhat was experienced during the incident (eg. striking yourself\nacross the back of the hand to show that your hand was hit as you\nwere trying to catch the disc).\nThe discussion should be as brief as possible with the preferred\noutcome being either a retracted call, or an uncontested\ncall. However once it becomes clear that no resolution will be\nreached, the disc should be returned to the last non- disputed\nthrower.\n\n\n\n\n\n\nSpirit of the Game Stoppage (Appendix 9)\n\nIf a team's captain believes that either or both teams are failing\nto follow the Spirit of the Game (SOTG), they may call a \"Spirit of\nthe Game Stoppage\". This can only be called:\nAfter a call which stops the play or any other stoppage, prior\nto the disc being checked in.\nAfter the start of a point and prior to the ensuing pull.\n\n\nDuring this stoppage, neither team may engage in tactical\ndiscussions. All team members of both teams will form a \"spirit\ncircle\" in the middle of the field.\nSeparately from the spirit circle, the two opposing team captains\nshall discuss all current issues with adherence to SOTG, determine\nactions to rectify those issues, and then convey the agreement to\nthe spirit circle.\nSOTG stoppages do not affect, nor are they affected by, the number\nof time-outs available.\nTime taken for a SOTG Stoppage will be added to the game time to\ndetermine time caps for the game. The captain initiating the\nStoppage will convey the start and end of the Stoppage to game\nofficials for time-keeping purposes.\n\nAdditional Reading:\n\nHuddle Issue #24 Top\nplayers from around the world, write about their views on SOTG.\nHistory of SOTG and observers in the game [pdf]", 
      "tags": "rules,spirit", 
      "loc": "/posts/rule-of-the-week-spirit-of-the-game.html", 
      "title": "Rule of the Week: Spirit of the Game"
    }, 
    {
      "text": "Surat Ultimate Open is here again!  For the second time in 2013,\nFountainhead School is going to host a tournament.  Delhi and Surat\nswapped spots on the calendar, due to some issues with organizing the\nDelhi tournament in November.\nThe last tournament in March 2013 was super fun, with good\naccommodation and awesome food arranged by the school, along with\namazing fields to play on and lots of teams!  Look at this facebook\nevent for more\ndetails on the upcoming tournament.  See you there!\nPS: I'm back to writing here, after a break of about a month!", 
      "tags": "surat,tournament,fun", 
      "loc": "/posts/surat-ultimate-open-2013-again.html", 
      "title": "Surat Ultimate Open 2013, Again!"
    }, 
    {
      "text": "TL;DR: Honesty, Intensity and Joy!  The reasons why I play Ultimate\nWhat the Huck.  Ultimate Frisbee® 101, for anyone who has ever thrown\na Frisbee® or a Flying Disc.  I gave a talk today at Barcamp titled\n\"What The Huck\", which was intended to be an introduction to Ultimate,\none that would hopefully get more people to play the sport.  But,\nunfortunately, I guess I chose the wrong title for the topic, and not\ntoo many people turned up for the talk.  So, I decided to post the\ngist of my talk here.\nFor those who do not know, what Ultimate Frisbee® is, here is a nice\none minute summary of the rules of the game.\nLong ago, a couple of friends shared with me a kind of a mantra that\nVivian Richards\nshared in an interview: Honesty, Intensity and Joy.  We just loved\nthis mantra.\nIn another time and age, the same couple of friends, introduced me to\nthe sport that I love, called Ultimate. (A shout out to\n@cloud9trt and @avudem for that!  Thanks folks!) This game\nwas fun, from the word go, but as I played it more and more, I fell in\nlove with this game.  As an after thought, I think one of the reasons\nI love this game, is because it imbibes all the three values that Viv\nmentioned: Honesty, Intensity and Joy.  Or actually, just for these\nthree things!\n\nHonesty\nI play Ultimate, for the Spirit\nit involves.  The rule #1\nof the game is the spirit of the game, and the whole game relies on\nthe fact that the game be played in it's spirit.  Unlike most other\nsports, Ultimate is self-refereed at the highest levels of the game.\nIt places the responsibility of fair play on every player, trusting\nthat no player would intentionally break the rules.  Essentially, the\ngame treats us as adults!  And that leads to a lot more intensity, and\na lot more fun in the games!  Games in tournaments (in India), end\nwith teams getting together in a spirit circle, where both the teams\ncircle up, and discuss, praise and criticize each others' games,\ngiving each other constructive and critical feedback.  You can play as\nintense a game as you want, and at the end of it, finish off with an\nequally important and intense, but stupid spirit games and go home with no\nhard feelings towards any of your opponents.\n\n\nIntensity\nThe game is intense.\nVery intense.  Very\nunlike the popular idea of throwing a disc in a park.\nThis intensity is a sort of a healer, for me.  Taking you into a\ndifferent sort of a world, away from the craziness of every day life.\nEach time you get on the field, you want to give your best, for\nyourself, and for your team.  Anyway, if you don't, you opponents\nwould kick your ass.  And that definitely doesn't feel good. ;)\n\n\nJoy\nI play for pure joy.  The sight of a disc floating in front of me, is\nso luring for me that I MUST chase it down and catch it.  The sight of\nplayers, even from your oppositions, jumping sky high to come down\nwith the disc is such a joy!\nUltimate involves a huge range of \"tasks\" - marking, defending,\ncatching, throwing.  Each of these tasks need quite a lot of practice\nto get good at.  Learning a new skill is always a joy, whether it is\nlearning to throw a forehand flick or a hammer, or it is to learn how\nthe zone defense works.\nIn conclusion, what I found out today is that it's quite difficult to\ntalk about a game you love, and get across it's awesomeness. Some\nthings can only be experienced first hand!  See you on the field!\nPS: A Huck is a long distance\npass - typically half the playing field or more. Hucks are a big part\nof many offensive strategies as they often result in quick points or\nsubstantial yardage gains.", 
      "tags": "talk,barcamp,ultimate,introduction", 
      "loc": "/posts/what-the-huck.html", 
      "title": "What the Huck!"
    }, 
    {
      "text": "I just stumbled upon this short, and sweet video.  I'm probably going to\nshow this as a part of my talk at the Barcamp on Sunday.", 
      "tags": "ultimate,rules,spirit", 
      "loc": "/posts/ultimate-101-video.html", 
      "title": "Ultimate 101 (video)"
    }, 
    {
      "text": "\"Where the @#@#@ is your commitment?\" -- our captain.\nIf you want to be a top player, a top team, you have no other option\nbut to practice as hard, with as much commitment as you can.  There's\nno two ways about it.\nEven if you are the only one in a practice session, it doesn't matter.\nThere are surely things, that you can work on your own upon.  Show up\nand Practice hard!  Set yourself goals,\nand work towards them.  Make yourself a training routine.  Do whatever\nit takes, to get better as an individual player, and as a team!", 
      "tags": "practice,player,top,team,commitment", 
      "loc": "/posts/just-show-up.html", 
      "title": "Just Show Up!"
    }, 
    {
      "text": "There's a barcamp next weekend, that I want to talk at, about\nUltimate.  I've, thankfully, been introduced to Ultimate through a\nbunch of friends, and playing it.  Then I came into contact with a\nwonderful team, who were extremely patient with me...\nI wonder what to talk about, at the barcamp.  I want to do justice to\nthese folks, and not ruin the game for them!  Any ideas on how to go\nabout, would be greatly appreciated.", 
      "tags": "beginners,talk,introduce,spirit,joy,noob-friendly", 
      "loc": "/posts/introducing-ultimate.html", 
      "title": "Introducing Ultimate"
    }, 
    {
      "text": "Another video, by Ultimate Rob, showing the Zen throwing routine\ndeveloped by Ben Wiggins.\nA pdf document for the routine, is here.", 
      "tags": "drill,practice,zen,throw", 
      "loc": "/posts/zen-throwing-routine.html", 
      "title": "Zen Throwing Routine"
    }, 
    {
      "text": "The new season of Ultimate has just begun, and most of the players are\nnoticeably rusty -- running slower, not able to get to the right place\nat the right time, rusty throws, etc.\nEven if you don't get a chance to play Ultimate,\n\nBuild strength; at the very least, keep fit.\nThink about Ultimate, talk it, watch it, read it, visualize it, ...\nJust thinking about the game, I feel, helps...", 
      "tags": "off-season,commitment,rant,ultimate", 
      "loc": "/posts/off-season-commitment.html", 
      "title": "Off-Season & Commitment"
    }, 
    {
      "text": "This is not really a post on Ultimate, but just a note on some of the\nchanges I made to the site.  I've spent quite a bit of time on the new\ntheme, and I like the way it has turned out.  I know, some of you are\nthinking, I could've gone to the field and got in some throws instead!\nYou can skip the rest of the post, if you are not interested in the\ndetails of how the site is published and the theme.  But, for the\ninterested, here are the details.\nThe site is powered by Nikola, a static site\ngenerator, written in Python.  The posts are written in plain text\nusing reStructured text.\nAnybody can contribute to the site, either by forking the repository\non GitHub and sending us a pull request, or just leave a comment on\nthis post, and we'll get back to you.\nThe theme is here. It is a mix\nof twitter's look and the Lagom4ni theme.  The theme changes\nthe background image automatically, by fetching a random image\nfrom Flickr.  Also, the image is analyzed to find the dominant color\nof the image and style the rest of the looks of the site.  The bottom\nof the page, contains a link to the original image on Flickr.  I'm not\nresponsible for any images that look inappropriate. ;)\nFinally, I've also designed a new logo\nfor the site.  It is a shameless ripoff of the \"I <3 NY\" theme.  The\nskying image is a derivative of this photograph.  Any suggestions\nto improve the logo are welcome!\nThanks to @kkrovvidi, @baali_, @cloud9trt, @riteshsaini and everyone else, who helped with\nthe logo and the theme design.\nAlso, I wish to update the post regularly.  I've even managed to get a\nnew scheduling feature\nadded to Nikola, for this!  I plan to update\nthe site every Monday, Wednesday and Friday at 8 am.  I wouldn't mind\na poke or two, from the readers, if I go out of schedule!  Thank you!", 
      "tags": "site,logo,design,updates", 
      "loc": "/posts/updates-to-the-site.html", 
      "title": "Updates to the site"
    }, 
    {
      "text": "During Hyderabad HAT, I was in the cup for most part and learnt a few\nthings about marking.  My marking improved slightly during the\ntournament, and all it needed was changing a couple of simple things.\n\nDistance from the handler\nI was getting broken left, right and center on zone offense.  I know\nthat I don't move as quickly as I should, to prevent a dump to the\nhandler on the break side.  But, thanks to help from Vrajesh, I\nrealized it's not all about speed.  I was getting broken too easily,\nbecause I'd stand too close to the handler and stepping around me was\nvery easy.  Standing back a couple of steps, helped me.  I was\nstruggling with this initially, but Vrajesh helped me with this on the\nside lines, asking me to step back a little, each time he saw me\nstepping too close, and soon I was able to judge the distance myself\nand adjust.  Stepping back made it harder for the handler to step\naround me and dump, leading to far fewer breaks.\n\n\nRunning to your (wo)man (handler)\nIf it's a pull, and you are running\ndown from the other end-zone, it helps if you run down on the break\nside, instead of running straight up.  Position yourself a little on\nthe breakside, so that you don't give away easy break side throws.  If\nyou are in a cup (or even otherwise), when you run to your (wo)man\n(from the force side), don't slow down as soon you reach within the\nmarking range (3 yards) of your (wo)man. Start slowing down, only once\nyou cross your man and get to the break side a little and try to stop\nas quickly as possible.  That way you are disallowing any easy\nbreakside throws, just by getting in the way of the throw, even if you\nare in no position to \"really mark\".  Then move in, and position\nyourself at the appropriate distance, angle and what not...  Look at\nthe image below to see, what I mean.", 
      "tags": "position,defense,tips,mark", 
      "loc": "/posts/marking-positioning-and-distance.html", 
      "title": "Marking: Positioning and Distance"
    }, 
    {
      "text": "Chennai Heat is coming soon! Oct 4 - 6,\nElliots Beach, Besant Nagar, Chennai!\nThe tournament is going to be super fun, with lots of play under lights. There\nare no games between 9am to 4pm.  I'm interested to see, what\nthe teams end up doing during that period. Lot more strategizing?  Or just\nhitting the streets of Chennai and binging on Sambar? ;)\nApart from the players (the ones I've played with, and new ones that I'll be\nplaying with and against), I'm looking forward to meeting the folks from Quad", 
      "tags": "tournament,chennai,beach,fun", 
      "loc": "/posts/chennai-heat.html", 
      "title": "Chennai Heat"
    }, 
    {
      "text": "First things first, the new season begins tomorrow! Yay! I've really had\nenough of off-season for this season.\nThis season, every game, I'm going to go with one thing that I want to work on\nfor each of offense and defense.  I'm going to stick with it, for as long as I\nneed to.  Until, I'm satisfied.\nDefense: Mark better.  Move my feet more than what I do.  Be on the move,\nwhile on the mark, rather than stand and lean over.  I'll keep posting on\nthings I discover, and try to make it \"measurable\".\nOffense: \"Just catch!\".\nI'm going to get more natural while catching, and not get very conscious about\nthe mechanics.  I think the mechanics need to be fixed during practice, but in\nthe game, I need to just catch!  Focus on attacking the disc, and getting it\nbefore your opponent or before it hits the ground.  Simple.\nHave a good season, folks!  Cheers!", 
      "tags": "practice,improve,game,goals", 
      "loc": "/posts/targetted-sessions.html", 
      "title": "Targetted sessions"
    }, 
    {
      "text": "Ultimate Rob recently made a nice video of the popular Kung-Fu Throwing\nroutine.  Just resharing it here, for those who haven't seen it.\nAn interesting trivia :\nKung-fu, in Chinese actually refers to any study, learning, or practice that\nrequires patience, energy, and time to complete. Ultimate Rob seems to agree.\nKung-fu throwing anyone? @pankaj, @voodoo?\nA pdf document for the routine, is here.", 
      "tags": "kung-fu,practice,drill,throw", 
      "loc": "/posts/kung-fu-throwing.html", 
      "title": "Kung fu Throwing"
    }, 
    {
      "text": "Quarter finals, Bangalore: We barely made into, and were elated about being\nin. Its the first half and we catch-up to 4-5 after we were trailing by a\nbigger margin. After some good defense, we are on O, and we make some nice\nmoves to move up to the end zone, and I ask for a disc that I didn't really\nhave. A man is on me, but the disc reaches before him, and I put it down, in\nthe endzone!  The game went on; my team wasn't mad at me and continued playing\nhard, but we lost the game 8-9.  The catch was a crucial one, that I think\ncost us the game.  I sat out for most of the rest of the game.  Others covered\nfor me, even when we had a really tiny squad.\nEverybody makes mistakes.  Great players, included.  But, what makes them\ngreat is that they put their mistakes behind them very quickly, atleast in the\nshort term and move on.  I think I've seen some of the players, even let their\nmistakes push them into \"the zone\", performing a few notches above what they\nwere, before they made that silly drop or made that wild throw.  Like its\nimportant to recover physically, in as short time as possible to be a good\nplayer/athlete (we can talk about that in another post, someday), its also\nimportant to atleast get over your mistakes in the short term (if not be\nmotivated, by them) and continue to play for the team.\nSon, you dropped a simple catch?  This is your chance for that psycho layout\nD!  Err, but recoverr...\nA couple of interesting blog posts by Jason, on this topic: Good Mistakes\n, It's not about you", 
      "tags": "mental-game,recovery,team,advice,mistake", 
      "loc": "/posts/recover-quick.html", 
      "title": "Recover quick!"
    }, 
    {
      "text": "Here's a lovely quote from the preface of Ultimate - Techniques & Tactics by James\nParinella and Eric Zaslow\n\nResolve yourself to becoming a good player. Good players chase down swill.\nGood players clear out.  Good players cut when they're tired. Good players\nremember the defense. Good players call for help when they need it. In\nfact, \"good\" players are great players. Great teams also require great\nteammates. Become a great teammate. Be ready to play on time. Critique but\ndon't criticize your teammates. Apologize for your mistakes. Take yourself\nout of the game when you're tired. Eschew pride.", 
      "tags": "good,how-to,improve,advice,tips,quote,player", 
      "loc": "/posts/good-players.html", 
      "title": "Good players -- A quote"
    }, 
    {
      "text": "Pankaj and I came up with a fun throwing and\ncatching drill, while just fooling around with a couple of discs.  Neither of\nus are very experienced players, and nor was this drill scientifically\ndesigned.  We just stumbled upon it, but it seems like it'll help improve a\nfew things in our game.  Read on.\n\nRequirements\n\na couple of discs\nsome place where you can throw the disc around (10-15 yards X 4-6 yards,\natleast)\nyourself and a partner\nthe desire to have some fun!\n\n\n\nHow does it work?\nYou and your partner stand about 5 yards apart, or any distance at which you\nwant to improve your throwing/catching.  You start with one person, throwing a\nbackhand and the other person flicking forehand.  Both of you throw the disc\nat the same time, and try to throw so that the discs collide mid-air, and then\ntry to catch the disc your partner has thrown at you. Once you catch the disc,\nthrow it back, as quickly as possible.  After a few throws, you switch the\nthrowing side (forehand-backhand). Repeat for as long as you are having fun!\nI never tried it, but trying it with hammers might be super-fun!\n\n\nBenefits of the drill\n\nBy trying to get the two discs to collide, you try to consistently get your\ndisc to travel along the same trajectory, effectively trying to repeat the\nsame throw. The consistency of your throws improves, given that you have\nalready got your basic technique right.\nWith your partner and yourself throwing discs at the same time, this drill\nhopefully helps you get rid of the habit of watching your own throws. You\ncould possibly improvise and modify the drill a little to get each other to\ntake a few steps in a specific direction, to get used to moving your feet\nimmediately after releasing the disc.\nSince you are quickly throwing and releasing, you don't really have much\ntime to \"think\" about your throwing or catching.  Once you have done enough\nof other drills to get a proper catching or throwing technique, this drill\nwill help you do it subconsciously, instead of thinking about getting it\nright. I find this quite helpful.\nAlso, trying to catch the disc after it hits the disc that you threw,\nhopefully teaches you to react quickly, and get used to catching wobbly\ndiscs that have been knocked around by your defenders.\nFinally, this drill is a lot more fun, than other throwing and catching\ndrills, I've been introduced to, until now.", 
      "tags": "throw,catch,drill", 
      "loc": "/posts/a-fun-drill.html", 
      "title": "A fun drill"
    }, 
    {
      "text": "When you are living in an Indian city, finding a field to play is a big deal.\nA real big deal. It hurts to not have your disc with you, when you have access\nto a lush green field, but don't have a disc to play with!  Always carry it!\n[If you care about your clothes, carry a pair of shorts and T too!]\nOn a more serious note, coaches encourage new players to carry around discs to\nget used to the disc in the hand [This is why you see kids dribbling their\nbasketballs everywhere, not just because it looks hip]. But don't just carry\nit, squeeze in a few minutes of deliberate practice, if you can, everyday --\nsomething tiny, like switching grips quickly, without using your non-throwing\nhand, work on your accuracy, etc.", 
      "tags": "disc,tips", 
      "loc": "/posts/carry-a-disc-always.html", 
      "title": "Carry a Disc, Always"
    }, 
    {
      "text": "I came across this nicely written post on the importance of practice\nsessions for a team.  Many of the points discussed are very common in\ndiscussions of our team, and possibly most other Ultimate teams, but it's nice\nto read it all at once place, written clearly and convincingly. It also comes\nwith some interesting and inspiring videos!\nSummary:\n\nThrows: Every practice session should start with a lot of throwing.\nDrills: do them as if your life depended on them\nFitness: Work on it yourself and with your team; Work on everything - speed,\nagility, power, strength\nStrategy: Try out a lot of things.  Keep learning\nPlay: There's no substitute to actual game time.", 
      "tags": "practice,throw,catch,drill,fitness,strategy", 
      "loc": "/posts/ultimate-practice.html", 
      "title": "Ultimate Practice"
    }, 
    {
      "text": "I just came across the news that Piyush Vaghela and Nilesh Solanki, fellow\nUltimate players, lost their lives, struck by a lightning during a practice\nsession!  My deepest condolonces to their near and dear ones.\nI met Piyush at the Surat Ultimate Open and enjoyed playing against him.  We\nmarked each other on quite a few points, in the game that was my first game in\na tournament.  He played hard, and pushed his team harder!  I vividly remember\nhim commending me on running hard and catching well.  I later chatted with\nhim, and was quite impressed with the work he was doing and his dream to give\nthe kids a platform to get greater exposure, through the sport!  Silent Voice\nwill surely miss him.\nPiyush, may your soul rest in peace! :'(", 
      "tags": "rip,death,memory,lightning,surat", 
      "loc": "/posts/rip-piyush.html", 
      "title": "RIP Piyush"
    }, 
    {
      "text": "HUFA (Hyderabad Ultimate Frisbee Association) is organizing a HAT tournament\nin Hyderabad on 17th and 18th August (Sat, Sun), at CCB grounds, Near\nShamshabad International Airport.\nFor the uninitialized, a hat tournament is a tournament where players register\nas individuals and teams are formed by drawing players names out of a hat.\nRegister here before 24th.", 
      "tags": "hyderabad,HAT,tournament", 
      "loc": "/posts/hyderabad-hat.html", 
      "title": "Hyderabad Hat"
    }, 
    {
      "text": "I came across this quote in an article on the huddle and just wanted to\narchive it here.\n\nThe best players treat competition as an opportunity for them to measure\ntheir greatness. Imagine a set of scales: you and your team are on one\nend, your opponents on the other. The fulcrum is made of the rules of the\ngame. If you break the rules, you unbalance the scales and lose the\naccuracy of the measurement. If you belittle your opponents, you lose your\ncounterweight, and diminish the meaning of any success you might have.\n(Your win doesn't mean very much if \"they suck.\") In order to evaluate\nyourself and your team honestly—that is, to have self-respect—you have to\ntreat your opponents and the rules with respect, and even gratitude.\nWithout them, you can't measure your greatness.", 
      "tags": "spirit,opponents,game,quote,greatness", 
      "loc": "/posts/opponents-greatness.html", 
      "title": "Opponents, SOTG & Greatness"
    }, 
    {
      "text": "Bangalore Ultimate Open is here! Play, Dive, Bond, Smile and Fly, from\nJuly 12th to 14th! See you at Sree Kanteerava Stadium, Bangalore!\nEDIT: The venue has been changed to Aditya Sports Complex, Nelamangala,\nBangalore.", 
      "tags": "bangalore,tournament", 
      "loc": "/posts/buo-is-here.html", 
      "title": "BUO is here!"
    }, 
    {
      "text": "In Tuesday's match, I got a couple of good D's, or so I thought, until\nI saw that the discs that I smacked away, didn't actually go crashing\ninto the ground, but instead just slowed down and became easy catches\nfor the guys that I D-ed.\nBoth the discs were \"catchable\", and I think I should've caught them.\nTo make sure that your disc crashes right into the ground, you need to\ntime your smack, and direct it correctly, and make sure you've enough\npower in your smack; and you already trying to time your jump, to get\nto the disc before your opponent!  Adding one more level of complexity\ndoesn't really help, does it?  Catching is something we are practicing\nall the time, and when the disc is catchable, I think it's best to let\nit stick into your hand, instead of trying to smack it down, and\nfailing and giving the opponents a chance to catch the disc.\nUltimate Rob feels the same.", 
      "tags": "defense,catch,sky,D,tips", 
      "loc": "/posts/catch-your-ds.html", 
      "title": "Catch Your D's"
    }, 
    {
      "text": "Having heroes that you look up-to, and emulate, is a big deal.\nThis is the one big piece of advice we got from Kayleigh, during\ndinner on Friday.  Kayleigh and Willis have left Mumbai after a busy\ncouple of months here, working extremely hard to teach us everything\nthey could, in the little time available.  Thanks a ton!\nKayleigh asked us, as beginners to watch (videos of) a lot of players\nand pick players that appeal to us the most as heroes to emulate.\nPick players with the plays that you find most beautiful, as heroes\nand try to emulate that aspect of the game, each time you are\npracticing and executing that play.  Pick players with a physique\nthat's not too different from yours.  Watch players flick and throw\nbackhands, pivot, layout, bust deep, mark, and pick the player that\nyou find the most beautiful and keep trying to emulate them, over and\nover.  I think it's worth emulating players in the way they train,\nthey conduct themselves on and off the field, and the way they\ninteract with their teammates and opponents...", 
      "tags": "heroes,role-models,inspiration", 
      "loc": "/posts/heroes.html", 
      "title": "Heroes"
    }, 
    {
      "text": "I have been playing ultimate once in a while. Or atleast I thought I did.\n\nA single day watching the folks play at the Juhu beach in Mumbai\nconvinced me that I was as good as someone who never played\nbefore. All I ever did was throw the disc without a technique,\ncatch it without a technique, run around without a strategy and\nhoped to score. I have practiced with them just a couple of\ntimes, played with them a couple of games and I can say that the\nexperience has been thrilling. I knew the basic rules of the game\nand loved it from the moment I heard of it. But there was a joy\nin watching people play in the manner in which they were. Clearly\ntrying to improve, with a lot of intensity and yet enjoying every\nbit of it. Most of all it is the people I have met, that have me\nexcited about the prospect of playing this game. The way they are\naccomodating to new comers is something which I have not\nexperienced earlier. I already knew Punch, who introduced me to\nthis wonderful group and has also been helping me fix my\nthrows. On my first day, Pixie helped me with the throws, Sheryl\nencouraged me to wait after I got the disc and make better\nthrows, and Chirag introduced the vertical stack to me. Though I\ngot a theoretical hang of it, I messed up big time in the game. I\ndid not touch the disc for the entire period of play. It was\ntotally due to my badly timed cuts. On my second day, I met\nGanesh. He amazed me with his patience. There was whole bunch of\nnew comers that day and he patiently took us aside to help us. He\nspent a lot his energy in trying to help us improve. This was an\nabsolutely wonderful experience. He was critical and encouraging\nat the same time, pointing out the flaws in what we were doing\nand helping us correct them. I learned more Ultimate in that one\nhour with Ganesh than all my previous trysts with it. His\nenthusiasm was infectious. I now look up to Ganesh and the other\nfolks. I want to practice more, improve myself, play better, get\nfitter, play harder and hopefully imbibe a little of their\nspirit. Maybe they just made me want to stick around in Mumbai\nfor a little longer than I had planned.", 
      "tags": "noob-friendly,spirit,joy", 
      "loc": "/posts/spirit-infected.html", 
      "title": "Spirit Infected"
    }, 
    {
      "text": "I need to practice forcing backhand, since we don't do it too often.\n\nIn general, our team forces flick/forehand, because it's a harder\nthrow (for beginners) than the backhand throw.  But, advanced players\nusually seem to have as good a forehand flick, if not better, than the\nbackhand.  We were practicing forcing backhand, yesterday.  As\nexpected, our marks were not as good as they were, when we were\nforcing forehand.  I was marking on the wrong side on a couple of\noccasions, and the mess-up lead to our opposition scoring, pretty\neasily. But, surprisingly, even our opposition seemed not ready to be\nforced backhand and took a while to adjust to the mark!\nAnyway, I realized it helps a lot to remind myself what the mark is,\nat the start of every point, and to translate that to, me facing\nhome/away.  Since the flick is a quicker throw than the backhand, when\nforcing backhand, we should be standing a little more towards the\nbreak-side than we would be if we were forcing flick -- our right\nshoulder in line with their right shoulder (assuming the thrower is\nright-handed).", 
      "tags": "force,mark,defense,strategy,tips", 
      "loc": "/posts/force-backhand.html", 
      "title": "Force Backhand"
    }, 
    {
      "text": "This is a random post on getting better at catching.\n\nYesterday's game: Light vs. Dark.  Score-line: 2-11 & 2-4.  A very\nlopsided game.  For the record, I was in the light/white team.  What\nwent wrong?  A lot of things, we were getting a lot of our basics\nwrong and the opposition was capitalizing on every small mistake we\nmade.  We were getting broken, left, right and center; Getting beaten\non the open side; and worst of all dropping simple catches -- unforced\nturnovers!  I'm guilty of a couple.\nI think the opposition was running hard in D and putting a lot of\npressure on us, but most of the catches that were dropped, seemed to\nme like the players were thinking of where they'll put the disc next,\neven before they got the disc in their hands.  Like they say, you\nshould be watching the disc into your hands, while catching it.  Set\nyourself, look around and put it, where you want to!\nThese are some of the things, I think would help avoid silly drops --\n\nWatch the disc into your hands, and catch it!\nDon't begin to think of your throw, before the catch.  Worse, don't\nlet yourself think about the fight you had with your boyfriend on\nthe previous night.\nGet comfortable with having the disc in your hands.\nEven if you are just a cutter, develop a reasonable arsenal of\nthrows, so you feel more comfortable getting the disc into your\nhands and passing it onto the handler.\n\nLot more tips in this issue of the huddle.\n\"If you touch it, you should catch it.\" -- Bill Burruss", 
      "tags": "catch,disc,advice", 
      "loc": "/posts/if-you-touch-it-you-should-catch-it.html", 
      "title": "If you touch it, you should catch it."
    }, 
    {
      "text": "Spirit of the Game (SOTG) is rule #1 of the game.  Ultimate relies on\na Spirit of the Game that places the responsibility of fair play on\nevery player.\n\nUnlike any other sport, Ultimate is self refreed at the highest levels\nof the game, and this demands a strong sense of sportsmanship and\nresponsibility from each one of the players.\nApart from the intensity of the game, and the joy it brings to see the\ndisc speed down the field and being grabbed from the air by a soaring\nplayer, the spirit with which the game is played is one of the things\nI love about the game.  I've been lucky to have been associated with a\nclub that respects the SOTG and has been consistently recognized for\nthat, in various tournaments.\nThe spirit of the game is not about not calling fouls.  It's not about\nplaying a less intense game, and to give away some easy plays to your\nopponent.  The spirit is about respect - respect for the sport, the\nrules, your opponent and yourself.  The spirit is about mental\ntoughness, and integrity.  It's about being consistent on your calls,\nno matter what the score line reads.  It's about courage, and\ncharacter.  Enough said.  The spirit, will mean different things to\ndifferent people.  But it's something that makes me proud of being an\nUltimate player.  It is what brings joy, to all the intensity in the\ngame!\nUnlike other sports, the spirit (of sportsmanship) is not a\nguideline.  It's in the rule book, and is the #1 rule.  I think, this\nis a very important thing to be taught to the new players, specially\nthose coming from other sports, where bending the rules when nobody\nis watching is an accepted part of the culture.\nAt a recent tournament, I had the chance to be a part of post-game\nspirit circles, where teams discuss each others' game including how to\nbetter adhere to the SOTG.  It's a very special experience and nothing\nlike anything I've been a part of before.  I've had goosebumps, just\nwatching the spirit circles of some of the other games!\nEnough said.  Now, go read the WFDF Rule #1.  And this edition of\nHuddle, for more on what some great Ultimate players think about the\nSpirit.", 
      "tags": "spirit,joy,rules,fun", 
      "loc": "/posts/spiritn-spirit-the-keystone-of-ultimate.html", 
      "title": "Spirit(n) /ˈspirit/: the keystone of Ultimate"
    }, 
    {
      "text": "A vertical stack is one of the first things you are taught as a\nbeginner.  This post will try to give you a brief overview of the\noffense in the vertical stack.\n\nI started off to write a detailed post on the stack, but found this\narticle.  I\nwould recommend you to first read this and come back to read the\nsummary below.\nHere are a few things, that I'd like to point out, about the V-Stack.\n\nSpacing and Timing are the most important things for a stack.\nThe idea of a stack is to create space for the cutters to cut into.\nThe stack should therefore be positioned in such a way that there's\nenough space on both the open side and the force side.  Look at the\nimage below. Note: There's usually a dump, and 5 players in the\nstack, unlike in the image.\n\n\n\nThe stack can be angled, so as to increase the cutting space, when\nthe disc is close to a sideline, with the head of the stack closer\nto the strong side.\nThe head of the stack should position at an optimal distance for the\nhandler to throw to the cutters.  Not too far off, or the handler\nwould basically have to huck, instead of a clean pass.  Not too\nclose, or the head of the stack gets in the way of the throws to the\ncutters, giving the first defender a chance to bid on them.\n\"There's only two speeds in Ultimate - Full Speed and Zero Speed\".\nWhen you don't get the disc, you clear out (move back into the\nstack) as quickly, if not faster, as you made your cut.  This will\nclear the lane out for the next cutters to try and make their cuts.\nThe animations on playspedia do not show it, nor does the text\nmention it, but it is a good idea for two cutters to cut almost\nsimultaneously on the open and the break sides.  The handler, then\nhas an option to throw on either side, depending on what his mark\ngives him.\n\n\n\n\n\n\nThough the animation above shows a player in the middle of the stack\ncutting first, the initial cutting patter of the last back cutting\nfirst is usually followed. (at least in beginner teams)\nThere need to be continuation cuts!  7 & 5, and 6 & 4, usually pair\nup to make the continuation cuts, on the force and break sides\nrespectively.  As, soon as 5 realizes that 7 is going to get the\ndisc, he should be making his cut.  Player 7, should have only\nenough time to set himself up, look up field and throw to an open 5!\nShe shouldn't have to wait for cuts to be made, since waiting with\nthe disc, gives the mark a chance to put up a better mark.\nThe stack needs to keep \"push\"ing (back), so that the head of the\nstack is in front of the disc.  It's the responsibility of the head\nof the stack to ensure this, and also ensure that there is\nco-ordination amongst the players of the stack and the right cuts\nare coming in at the right time.\nWhen you are cutting from the stack, make sure that you co-ordinate\nwith other players in the stack, so as to not block each others'\ncuts.\nAfter the stall count reaches about 6, the handler will stop looking\nup-field and activate the dump.  The cutters in the stack, should\nthen stop making cuts to make space for the dump cut.  Look at steps\n7 and 8 in the animation above, to see a dump cut.\nPlayer 2, could have either received the disc at step 7, an up line\npass or at step 8, a dump pass.  The stack should be prepared for a\ndump and swing and make the appropriate cut, at this point.  The\nanimation nicely shows player 2, already starting his cut for the\nswing.  Once the disc is swung from the open side to the break side,\nthe disc can get a lot of yardage, since the defenders were caught\non the wrong side of the stack.\nRemember, spacing and timing!\n\nNow, Stack on me!", 
      "tags": "stack,offense,strategy", 
      "loc": "/posts/vert-stack-the-basics.html", 
      "title": "Vert Stack: The Basics"
    }, 
    {
      "text": "A \"pick\" is a violation in Ultimate, that is called by a defender when he is\nscreened from getting to the disc.\n\nA screen, in general, is a blocking move by an offensive player to\nblock or obstruct the movement of a defender, to free a teammate to\nshoot, receive a pass, or drive in to score. In basketball, it is also\nknown as a pick.  While this is allowed and commonly used in sports\nlike basketball, a defender in Ultimate can call a Pick.\nFrom #18.3 WFDF Rules :\n\nIf a defensive player is guarding an offensive player and they are\nprevented from moving towards/with that player by another player,\nthat defensive player may call \"Pick\"\nOnce play has stopped, the obstructed player may move to the agreed\nposition they would have otherwise occupied if the obstruction had\nnot occurred. The disc is returned to the thrower (if the disc was\nthrown)\n\nNote from the official interpretation :\n\nA pick should only be called if the obstructed player is within 3\nmetres of the player they were guarding at the time they were\nobstructed. However they do not need to be less than 3 metres away\nat the time of the call because the obstruction may cause this\ndistance to quickly grow before the call can be made.\nA pick cannot be called by the offense.\nA pick should not be called by a defender who was obstructed while\nattempting to make a play on the disc, that is not related to their\nability to move towards/with the player they are guarding (however a\ndefender may call a violation under Rule 12.7 if applicable).\n\nIn Ultimate, a player calls a Violation, by either calling \"Violation\"\nor the specific name of the violation, \"Pick\" in this case.  The\nplayer can also show the hand signal, in the image, when calling a\npick.\n\nWFDF has a nice decision diagram illustrating the various scenarios.\nI'll not go into explaining them in detail, unless something really\nneeds to be.\n\nCredits: The images are courtesy WFDF rule books!", 
      "tags": "rules,foul,violation,infraction", 
      "loc": "/posts/what-is-a-pick.html", 
      "title": "What is a Pick?"
    }, 
    {
      "text": "Welcome! This is a site by a bunch of guys who fell in love with Ultimate.\n\nWe wish to ramble here about all things Ultimate! The coolest game in the World!\n\nImage by Toby Green.", 
      "tags": "", 
      "loc": "/posts/welcome-to-ultimate-sport.html", 
      "title": "Welcome to Ultimate Sport"
    }
  ]
}